#include "dataProcedures.h"

void sortMatrix()
{
	cout << "\n *—ортуванн€ р€дк≥в матриц≥ за зростанн€м перших елемент≥в*\n\n";
	// ƒл€ спрощенн€ розм≥ри матриц≥ задамо в код≥ програми
	int a[n][m];
	// ¬водимо задану матрицю
	readMatrix(a);
	// ¬ѕќ–яƒ ”¬јЌЌя ѕ≈–Ўќ√ќ —“ќ¬ѕ÷я ћј“–»÷≤ «ј ƒќѕќћќ√ќё ¬»Ѕќ–” Ќј…Ѕ≤Ћ№Ўќ√ќ
	for (unsigned j = n; j > 1; --j)
	{
		// знаходимо найб≥льший елемент невпор€дкованоњ частини
		unsigned k = 0;                  // початковий номер найб≥льшого
		for (unsigned i = 1; i < j; ++i) // перев≥р€Їмо вс≥ решту
			if (a[i][0] > a[k][0]) k = i;
		// м≥н€Їмо м≥сц€ми р€дки: j-й з k-им
		exchange(a[j - 1], a[k], m);
	}
	// ƒрукуЇмо результати
	printMatrix(a);
	return;
}