#include "loopsProcedures.h"

void regionsSumming()
{
	cout << "\n *Побудова матриці з сум прямокутних частин іншої матриці*\n\n";
	// Для спрощення початкову матрицю задамо в коді програми
	const unsigned n = 7;
	int a[n][n] = {{ 1, 2, 0,-1,-2, 1,}, {-1, 0, 1, 2, 3,-2,}, { 0, 1,-1, 1, 0, 2, 3},
	{ 2, 3,-2,-1, 1, 0, 2}, { 1, 0, 1,-1, 0,-1, 1}, { 2,-1, 1, 1, 1,-1,-2}, {-3, 1,-2, 1,-1, 1, 2}};
	// Ініціалізацію можна легко замінити введенням з файла
	/*
	ifstream f("matrix.txt");
	for (int i = 0; i < n; ++i) for (int j = 0; j < n; ++j) f >> a[i][j];
	*/
	// виділення пам'яті для динамічної матриці
	int ** b = createMatrix(n);
	for (int i = 0; i < n; ++i)
	{							// перебираємо елементи матриці B
		for (int j = 0; j < n; ++j)
		{
			int s = 0;          // сумуємо елементи відповідної області
			for (int k = 0; k <= i; ++k)
				for (int l = j; l < n; ++l) s += a[k][l];
			b[i][j] = s;
		}
	}
	// виведення результатів
	printMatrix(b, n);
	eraseMatrix(b);
	return;
}

void economySumming()
{
	cout << "\n *Економна побудова матриці з сум прямокутних частин іншої матриці*\n\n";
	// Для спрощення початкову матрицю задамо в коді програми
	const unsigned n = 7;
	int a[n][n] = {{ 1, 2, 0,-1,-2, 1,}, {-1, 0, 1, 2, 3,-2,}, { 0, 1,-1, 1, 0, 2, 3},
	{ 2, 3,-2,-1, 1, 0, 2}, { 1, 0, 1,-1, 0,-1, 1}, { 2,-1, 1, 1, 1,-1,-2}, {-3, 1,-2, 1,-1, 1, 2}};
	// виділення пам'яті для динамічної матриці
	int ** b = createMatrix(n);
	// формуємо останній стовпець
	int n1 = n - 1;
	b[0][n1] = a [0][n1];
	for (int i = 1; i < n; ++i)
		b[i][n1] = b[i - 1][n1] + a[i][n1];
	// рекурентно обчислюємо решту стовпців
	for (int j = n1 - 1; j >= 0; --j)
	{
		int s = 0;   // сума & нові елементи одночасно
		for (int i = 0; i < n; ++i)
		{
			s += a[i][j];
			b[i][j] = b[i][j + 1] + s;
		}
	}
	// виведення результатів
	printMatrix(b, n);
	eraseMatrix(b);
	return;
}
