#include <iostream>
#include <windows.h>
//#include <cstdlib>
#include <cfloat>
#include <cmath>
#include "Functions.h"

using namespace std;


int main()
{
	SetConsoleOutputCP(1251);
	double x, y, z;

	cout << "Випробування різних функцій обчислення середнього гармонійного\n\n";
	cout << "        *** #1 *** Можливе завершення програми\n\nВведіть два числа: ";
	// Задайте х == -у, щоб спровокувати проблему
	while (cin >> x >> y)
	{
		z = harmonic_1(x, y);
		cout << "Середнє гармонійне чисел " << x << " та " << y << " є " << z << "\n\n"
			<< "Введіть наступні два числа (або Q, щоб вийти): ";
	}
	cin.clear(); while (cin.get() != '\n'); // очищення потоку введення

	cout << "        *** #2 *** Перевірка коду завершення\n\nВведіть два числа: ";
	// Задайте х == -у, щоб спровокувати проблему
	while (cin >> x >> y)
	{
		if (harmonic_2(x, y, &z))
			cout << "Середнє гармонійне чисел " << x << " та " << y << " є " << z << "\n\n";
		else
			cout << "Числа не можуть бути протилежними. Спробуйте ще.\n\n";
		cout << "Введіть наступні два числа (або Q, щоб вийти): ";
	}
	cin.clear(); while (cin.get() != '\n');

	cout << "        *** #3 *** Використання захищеного блоку\n\nВведіть два числа: ";
	// Задайте х == -у, щоб спровокувати проблему
	while (cin >> x >> y)
	{
		try
		{
			z = harmonic_3(x,y);
		}
		catch (const char * s)
		{
			cout << s <<"\n\n"
				<< "Введіть наступні два числа (або Q, щоб вийти): ";
			continue;
		}
		cout << "Середнє гармонійне чисел " << x << " та " << y << " є " << z << "\n\n"
			<< "Введіть наступні два числа (або Q, щоб вийти): ";
	}
	cin.clear(); while (cin.get() != '\n');

	cout << "        *** #3a *** Перехоплення винятків від різних функцій\n\nВведіть два числа: ";
	// Щоб спровокувати проблему, введіть:
	// х == у == DBL_MAX - переповнення в середньому арифметичному
	// х == -у  - ділення на нуль в середньому гармонійному
	// x<0 || y<0 - корінь з від'ємного в середньому геометричному 
	double a, g;
	while (cin >> x >> y)
	{
		try
		{
			a = arithmetic(x, y);
			z = harmonic_3(x, y);
			g = geometric(x, y);
		}
		catch (const char * s)
		{
			cout << s << "\n\n"
				<< "Введіть наступні два числа (або Q, щоб вийти): ";
			continue;
		}
		cout << "Введено числа: " << x << " та " << y << "\nСереднє арифметичне: " << a
			<< "\nСереднє гармонійне: " << z << "\nСереднє геометричне: " << g
			<< "\n\nВведіть наступні два числа (або Q, щоб вийти): ";
	}
	cin.clear(); while (cin.get() != '\n');

	cout << "        *** #4 *** Розпізнавання винятків різних типів\n\nВведіть два числа: ";
	// Щоб спровокувати проблему в середньому гармонійному, введіть:
	// х == -у  - ділення на нуль 
	// x==0 || y==0 - недопустиме значення аргумента 
	while (cin >> x >> y)
	{
		try
		{
			z = harmonic_4(x, y);
		}
		catch (DivByZero)
		{
			cout << "Числа не можуть бути протилежними. Спробуйте ще.\n\n";
			continue;
		}
		catch (ZeroArg)
		{
			cout << "Жодне з чисел не може бути нулем. Спробуйте ще.\n\n";
			continue;
		}
		cout << "Середнє гармонійне чисел " << x << " та " << y << " є " << z << "\n\n"
			<< "Введіть наступні два числа (або Q, щоб вийти): ";
	}
	cin.clear(); while (cin.get() != '\n');

	cout << "        *** #5 *** Розпізнавання винятків стандартних типів\n\nВведіть два числа: ";
	// Щоб спровокувати проблему в середньому гармонійному, введіть х == -у
	while (cin >> x >> y)
	{
		try
		{
			z = harmonic_5(x, y);
		}
		catch (exception & ex)
		{
			cout << ex.what() << " Спробуйте ще.\n\n";
			continue;
		}
		cout << "Середнє гармонійне чисел " << x << " та " << y << " є " << z << "\n\n"
			<< "Введіть наступні два числа (або Q, щоб вийти): ";
	}

	cout << "BYE!\n"; system("pause");
	return 0;
}

