#include "calcProcedures.h"

void sinSeriesSum()
{
	cout << "\n *Обчислення суми ряду Тейлора - розкладу sin(x)*\n\n"
		<< "Введіть дійсне число x = ";
	double x; cin >> x;
	// Приготування до обчислень
	double y = -x*x; // часто вживаний множник
	double d = x;    // перший член ряду
	double s = x;    // сума ряду
	int n = 2;       // черговий множник для факторіала
	while (abs(d) > 1e-6)
	{
		// черговий член ряду обчислюємо за рекурентною формулою
		d *= y / (n*(n + 1));
		s += d;  // враховуємо його в сумі ряду
		n += 2;
	}
	cout << "S = " << s << "   sin(x) = " << sin(x) << '\n';
	return;
}