#include "calcProcedures.h"

void sumOfSeriesB()
{
	cout << "\n *Обчислення суми ряду S( -1^k x^4k+3 / (2k+1)!(4k+3) )*\n\n"
		<< "Введіть дійсне число x = ";
	double x; cin >> x;
	cout << "Задайте точність обчислень eps = ";
	double eps; cin >> eps;
	// Приготування до обчислень
	double y = x*x;
	double d = x*y;  // перший член ряду без дільника (4k+3)
	double s = d/3;  // сума ряду
	y = -y*y;        // часто вживаний множник
	int k = 0;       // номер врахованого доданка
	while (abs(d) > eps)
	{
		// черговий член ряду обчислюємо за рекурентною формулою
		++k;
		d *= y / (2 * k*(2 * k + 1));
		s += d / (4 * k + 3);  // враховуємо його в сумі ряду
	}
	cout << "S(" << x << ") = " << s << '\n';
	return;
}