#include "processProcedures.h"
#include <string>

void countCharByChar()
{
	cout << "\n *Кількість цифр у рядку літер, посимвольне введення*\n\n"
		<< "Введіть послідовність літер, що закінчується крапкою:\n";
	unsigned k = 0;     // лічильник цифр
	char c;
	do
	{
		c = cin.get();  // отримання з потоку чергової літери
		if (c >= '0' && c <= '9') ++k;
	} while (c != '.'); // опрацювання триває до першої крапки
	cout << "Послідовність містить " << k << " цифр\n";
	return;
}

void countInString()
{
	cout << "\n *Кількість цифр у рядку - масиві літер та в контейнері*\n";

	cout << "\n-Рядок в стилі С-\n";
	const unsigned size = 256;  // потрібно задати розмір масиву літер
	char line[size] = { '\0' }; // масив ініціалізуємо літерами з кодом 0
	cout << "Введіть послідовність літер, що містить цифри:\n";
	cin.get(line, size);        // введений рядок обмежений розміром масиву
	while (cin.get() != '\n')   // очищаємо потік від можливого залишку рядка
		continue;
	unsigned k = 0;             // лічильник цифр
	for (unsigned i = 0; line[i] != '\0'; ++i)
	{
		if (line[i] >= '0' && line[i] <= '9') ++k;
	}
	cout << "Послідовність містить " << k << " цифр\n";

	cout << "\n-Рядок бібліотеки std-\n";
	std::string Line;   // контейнер змінного розміру
	cout << "Введіть послідовність літер, що містить цифри:\n";
	getline(cin, Line); // будуть прочитані всі літери до кінця рядка '\n'
	k = 0;              // лічильник цифр використаємо той самий
	for (unsigned i = 0; i < Line.length(); ++i)
	{
		if (Line[i] >= '0' && Line[i] <= '9') ++k;
	}
	cout << "Послідовність містить " << k << " цифр\n";
	return;
}
