#include "sortProcedures.h"

// ¬ѕќ–яƒ ”¬јЌЌя ћј—»¬” а ѕ–ќ—“»ћ» ¬—“ј¬ јћ»
void simpleInsertSort(int * a, unsigned n)
{
	// спочатку впор€дкованим Ї лише перший елемент посл≥довност≥
	// переберемо вс≥ ≥нш≥ ≥ кожен з них вставимо на в≥дпов≥дне м≥сце
	for (unsigned j = 1; j < n; ++j)
	{
		// шукаЇмо м≥сце дл€ j-го елемента
		int b = a[j];
		int i = j - 1;
		while (i >= 0 && a[i] > b)
		{					// посуваЇм впор€дкован≥ елементи
			a[i + 1] = a[i];
			--i;
		}
		// вставл€Їм j-ий елемент у впор€дковану частину
		a[i + 1] = b;
	}
	return;
}